***** 1: Regex, find entry for each day
- regex on ~Exodus.*#~, traverse through each entry

  #+begin_src emacs-lisp :tangle yes
(defun all-exodus-entries-in-buffer ()
  (s-match-strings-all
   "Exodus.*#[0-9][0-9].*"
   (buffer-string)))
(all-exodus-entries-in-buffer)
#+end_src

#+RESULTS:
| Exodus #83 (06-25-23 Sun): |
| Exodus #82 (06-23-23 Fri): |
| Exodus #81 (06-21-23 Wed): |
| Exodus #80 (06-19-23 Mon): |
| Exodus #79 (06-18-23 Sun): |
| Exodus #78 (06-12-23 Mon): |
| Exodus #77 (06-11-23 Sun): |
| Exodus #76 (06-09-23 Fri): |
| Exodus #75 (06-08-23 Thu): |
| Exodus #74 (06-07-23 Wed): |
| Exodus #73 (06-06-23 Tue): |
| Exodus #72 (06-05-23 Mon): |
| Exodus #71 (06-04-23 Sun): |
| Exodus #70 (06-03-23 Sat): |
| Exodus #69 (06-02-23 Fri): |
| Exodus #68 (06-01-23 Thu): |

***** 1: Regex, find single entry for current date
- regex on ~Exodus.*#~, traverse through each entry

  #+begin_src emacs-lisp :tangle yes
(defun all-exodus-entries-in-buffer ()
  (s-match-strings-all
   "Exodus.*#[0-9][0-9].*"
   (buffer-string)))
(all-exodus-entries-in-buffer)
#+end_src

#+RESULTS:
| Exodus #83 (06-25-23 Sun): |
| Exodus #82 (06-23-23 Fri): |
| Exodus #81 (06-21-23 Wed): |
| Exodus #80 (06-19-23 Mon): |
| Exodus #79 (06-18-23 Sun): |
| Exodus #78 (06-12-23 Mon): |
| Exodus #77 (06-11-23 Sun): |
| Exodus #76 (06-09-23 Fri): |
| Exodus #75 (06-08-23 Thu): |
| Exodus #74 (06-07-23 Wed): |
| Exodus #73 (06-06-23 Tue): |
| Exodus #72 (06-05-23 Mon): |
| Exodus #71 (06-04-23 Sun): |
| Exodus #70 (06-03-23 Sat): |
| Exodus #69 (06-02-23 Fri): |
| Exodus #68 (06-01-23 Thu): |
